app/views/shared/_user_info.html.erb

<span><%= link_to "个人信息", current_user %></span>
<span><%= pluralize(current_user.microposts.count, "微博") %></span>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 762146111]]