app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    #@users = User.paginate(page: params[:page])
    @users = User.paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 762146111], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 762146111]]
---
  def show
    @user = User.find(params[:id])
    #redirect_to root_url and return unless FILL_IN
    @microposts = @user.microposts.paginate(page: params[:page])